Dlubal.RFEM5.ILoadCase
Interface for working with load case

Dlubal.RFEM5.ILoadCase.PrepareModification
Prepares application for load modification.

Dlubal.RFEM5.ILoadCase.FinishModification(System.Boolean)
Finishes load modification and updates the model.
CheckDuplicity: Check or don't check load duplicity.

Dlubal.RFEM5.ILoadCase.CancelModification
Cancels current data modification.

Dlubal.RFEM5.ILoadCase.IgnoreErrors(System.Boolean)
Ignores throwing exception while set values are invalid.
Ignore: Disable or disable throwing exception while set invalid loads.

Dlubal.RFEM5.ILoadCase.EnableSelections(System.Boolean)
Allows you to work with selected loads only.
Enable: Enable/disable work with only selected loads.

Dlubal.RFEM5.ILoadCase.SelectObjects(System.UInt32,System.String)
Selects loads of specified type.
Type: Type of loads.
List: List of objects No. to select. E.g.: "1,2,3"; "1-5"; "1-3,5"; "all".

Dlubal.RFEM5.ILoadCase.GetLastObjectNo(System.UInt32)
Gets number of last load object.
Returns: Number of last object.
Type: Type of load object.

Dlubal.RFEM5.ILoadCase.Clean
Cleans load case.

Dlubal.RFEM5.ILoadCase.DeleteObjects(System.UInt32,System.String)
Deletes specified loads.
Type: Type of loads.
List: List of loads No. to delete. E.g.: "1,2,3"; "1-5"; "1-3,5"; "all"

Dlubal.RFEM5.ILoadCase.SetObjectID(System.UInt32,System.Int32,System.UInt32,System.String)
Sets ID of the load.
Type: Type of load object
No: Number or index of the load
At: Specifies the type of access
ID: New ID to be set

Dlubal.RFEM5.ILoadCase.PlausibilityCheck(System.UInt32@)
Checks validity of loads.
Returns: Returns true if model has no error, otherwise returns false.
Error: Information about the error. If this parameter is set to null then no error occurred.

Dlubal.RFEM5.ILoadCase.HasResults
Indicates that load case has any results.
Returns: True if the load case has any results, otherwise false.

Dlubal.RFEM5.ILoadCase.GetData
Gets load case parameters.
Returns: Load case parameters

Dlubal.RFEM5.ILoadCase.SetData(System.UInt32@)
Sets load case parameters.
LCase: Load case parameters

Dlubal.RFEM5.ILoadCase.Delete
Deletes load case.

Dlubal.RFEM5.ILoadCase.GetAnalysisParameters
Gets analysis parameters.
Returns: Analysis parameters

Dlubal.RFEM5.ILoadCase.SetAnalysisParameters(System.UInt32@)
Sets analysis parameters.
Analysis: Analysis parameters

Dlubal.RFEM5.ILoadCase.GetIncrementallyIncreasingLoading
Get incrementally increasing loading parameters
Returns: Incrementally increasing loading parameters

Dlubal.RFEM5.ILoadCase.SetIncrementallyIncreasingLoading(System.UInt32@)
Set incrementally increasing loading parameters
Loading: incrementally increasing loading parameters

Dlubal.RFEM5.ILoadCase.GetNodalLoadCount
Gets count of nodal loads.
Returns: Count of nodal loads in the model.

Dlubal.RFEM5.ILoadCase.GetNodalLoad(System.Int32,System.UInt32)
Gets interface for working with nodal load.
Returns: Load interface.
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetNodalLoad(System.UInt32@)
Sets nodal load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetNodalLoads
Gets array of nodal loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetNodalLoads(System.UInt32@)
Sets array of nodal loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetMemberLoadCount
Gets count of member loads.
Returns: Count of member loads in the model.

Dlubal.RFEM5.ILoadCase.GetMemberLoad(System.Int32,System.UInt32)
Gets interface for working with member load.
Returns: Load interface.
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetMemberLoad(System.UInt32@)
Sets member load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetMemberLoads
Gets array of member loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetMemberLoads(System.UInt32@)
Sets array of member loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetLineLoadCount
Gets count of line loads.
Returns: Count of line loads in the model.

Dlubal.RFEM5.ILoadCase.GetLineLoad(System.Int32,System.UInt32)
Gets line load interface.
Returns: Load interface.
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetLineLoad(System.UInt32@)
Sets line load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetLineLoads
Gets array of line loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetLineLoads(System.UInt32@)
Sets array of line loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetSurfaceLoadCount
Gets count of surface loads.
Returns: Count of surface loads in the model.

Dlubal.RFEM5.ILoadCase.GetSurfaceLoad(System.Int32,System.UInt32)
Gets surface load interface.
Returns: Load interface.
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetSurfaceLoad(System.UInt32@)
Sets surface load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetSurfaceLoads
Gets array of surface loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetSurfaceLoads(System.UInt32@)
Sets array of surface loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetSolidLoadCount
Gets count of solid loads.
Returns: Count of solid loads in the model.

Dlubal.RFEM5.ILoadCase.GetSolidLoad(System.Int32,System.UInt32)
Gets interface for working with solid load.
Returns: Load interface.
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetSolidLoad(System.UInt32@)
Sets solid load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetSolidLoads
Gets array of solid loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetSolidLoads(System.UInt32@)
Sets array of solid loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetFreeConcentratedLoadCount
Gets count of free concentrated loads.
Returns: Count of free concentrated loads in the model.

Dlubal.RFEM5.ILoadCase.GetFreeConcentratedLoad(System.Int32,System.UInt32)
Gets interface for working with free concentrated load.
Returns: Load interface
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetFreeConcentratedLoad(System.UInt32@)
Sets free concentrated load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetFreeConcentratedLoads
Gets array of free concentrated loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetFreeConcentratedLoads(System.UInt32@)
Sets array of free concentrated loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetFreeLineLoadCount
Gets count of free line loads.
Returns: Count of free line loads in the model.

Dlubal.RFEM5.ILoadCase.GetFreeLineLoad(System.Int32,System.UInt32)
Gets interface for working with free line load.
Returns: Load interface.
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetFreeLineLoad(System.UInt32@)
Sets free line load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetFreeLineLoads
Gets array of free line loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetFreeLineLoads(System.UInt32@)
Sets array of free line loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetFreeRectangularLoadCount
Gets count of free rectangular loads.
Returns: Count of free rectangular loads in the model.

Dlubal.RFEM5.ILoadCase.GetFreeRectangularLoad(System.Int32,System.UInt32)
Gets interface for working with free rectangular load.
Returns: Load interface.
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetFreeRectangularLoad(System.UInt32@)
Sets free rectangular load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetFreeRectangularLoads
Gets array of free rectangular loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetFreeRectangularLoads(System.UInt32@)
Sets array of free rectangular loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetFreeCircularLoadCount
Gets count of free circular loads.
Returns: Count of free circular loads in the model.

Dlubal.RFEM5.ILoadCase.GetFreeCircularLoad(System.Int32,System.UInt32)
Gets free circular Load interface.
Returns: Load interface.
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetFreeCircularLoad(System.UInt32@)
Sets free circular load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetFreeCircularLoads
Gets array of free circular loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetFreeCircularLoads(System.UInt32@)
Sets array of free circular loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetFreePolygonLoadCount
Gets count of free polygon loads.
Returns: Count of free polygon loads in the model.

Dlubal.RFEM5.ILoadCase.GetFreePolygonLoad(System.Int32,System.UInt32)
Gets interface for working with free polygon load.
Returns: Load interface.
No: No. or index of the load you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetFreePolygonLoad(System.UInt32@)
Sets free polygon load and returns it's interface.
Returns: Load interface
Load: Load parameters

Dlubal.RFEM5.ILoadCase.GetFreePolygonLoads
Gets array of free polygon loads.
Returns: Array of loads.

Dlubal.RFEM5.ILoadCase.SetFreePolygonLoads(System.UInt32@)
Sets array of free polygon loads.
Loads: Array of loads to be set.

Dlubal.RFEM5.ILoadCase.GetImposedNodalDeformationCount
Gets count of imposed nodal deformations.
Returns: Count of imposed nodal deformations in the model.

Dlubal.RFEM5.ILoadCase.GetImposedNodalDeformation(System.Int32,System.UInt32)
Gets interface to imposed nodal deformation.
Returns: Imposed nodal deformation interface.
No: No. or index of the imposed nodal deformation you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetImposedNodalDeformation(System.UInt32@)
Sets imposed nodal deformation and returns it's interface.
Returns: Imposed nodal deformation interface
Deformation: Imposed nodal deformation parameters

Dlubal.RFEM5.ILoadCase.GetImposedNodalDeformations
Gets array of imposed nodal deformations.
Returns: Array of imposed nodal deformations.

Dlubal.RFEM5.ILoadCase.SetImposedNodalDeformations(System.UInt32@)
Sets array of imposed nodal deformations.
Deformations: Array of imposed nodal deformations to be set.

Dlubal.RFEM5.ILoadCase.GetImposedLineDisplacementCount
Gets count of imposed line displacements.
Returns: Count of imposed line displacements in the model.

Dlubal.RFEM5.ILoadCase.GetImposedLineDisplacement(System.Int32,System.UInt32)
Gets interface for working with imposed line displacement.
Returns: Imposed line displacement interface.
No: No. or index of the imposed line displacement you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetImposedLineDisplacement(System.UInt32@)
Sets imposed line displacement and returns it's interface.
Returns: Imposed line displacement interface
Displacement: Imposed line displacement parameters

Dlubal.RFEM5.ILoadCase.GetImposedLineDisplacements
Gets array of imposed line displacements.
Returns: Array of imposed line displacements.

Dlubal.RFEM5.ILoadCase.SetImposedLineDisplacements(System.UInt32@)
Sets array of imposed line displacements.
Displacements: Array of imposed line displacements to be set.

Dlubal.RFEM5.ILoadCase.GetImperfectionCount
Gets count of imperfections.
Returns: Count of imperfections in the model.

Dlubal.RFEM5.ILoadCase.GetImperfection(System.Int32,System.UInt32)
Gets imperfection interface.
Returns: Imperfection interface.
No: No. or index of the imperfection you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoadCase.SetImperfection(System.UInt32@)
Sets imperfection and returns it's interface.
Returns: Load interface
Imperfection: Load parameters

Dlubal.RFEM5.ILoadCase.GetImperfections
Gets array of imperfections.
Returns: Array of imperfections.

Dlubal.RFEM5.ILoadCase.SetImperfections(System.UInt32@)
Sets array of imperfections.
Imperfections: Array of imperfections to be set.